app/Services/AuthService.php

SELECT *
FROM `usuarios`
WHERE `email` = 'teste3@email.com'
AND `usuarios`.`deleted_at` IS NULL
 LIMIT 1
---
    public function autenticar(string $email, string $senha): array
    {
        $usuario = $this->usuarios->where('email', $email)->first();