app/Controllers/AuthController.php

    public function login()
    {
        // Models
        $NiveisModel = new NiveisModel();


        $request = service('request');
        $email = $request->getVar('email');
        $senha = $request->getVar('password');

        // Verifica se os campos foram enviados
        if (!$email || !$senha) {
            return $this->response->setJSON([
                'success' => false,
                'message' => 'Email e senha são obrigatórios'
            ])->setStatusCode(400);
        }

        // Busca o usuário pelo email
        $usuario = $this->usuarioModel->where('email', $email)->first();
---
SELECT *
FROM `usuarios`
WHERE `email` = 'teste1@email.com'
AND `usuarios`.`deleted_at` IS NULL
 LIMIT 1