app/Controllers/NiveisController.php

SELECT *
FROM `niveis`
ORDER BY `id` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `niveis`
---
    public function index()
    {
        $perPage = 10;
        $page = $this->request->getVar('page') ?? 1;

        $niveis = $this->niveisModel->orderBy('id', 'DESC')->paginate($perPage);