app/Controllers/PermissoesController.php

    public function updateByNivel($nivelId)
    {
        $niveisModel = new NiveisModel();
        $niveisXPermissoesModel = new NiveisXPermissoes();
        $permissoesModel = new PermissoesModel();

        $nivel = $niveisModel->find($nivelId);
---
SELECT *
FROM `niveis`
WHERE `niveis`.`id` = '2'

            }

        // Atualiza o nome do nível
        if (!$niveisModel->update($nivelId, ['nome' => $data['nome']])) {
---
UPDATE `niveis` SET `nome` = 'Padrao', `updated_at` = '2025-10-07 04:36:17'
WHERE `niveis`.`id` IN ('2')

        }

        // Retorna nível atualizado
        $nivel = $niveisModel->find($nivelId);
---
SELECT *
FROM `niveis`
WHERE `niveis`.`id` = '2'