app/Controllers/UsuarioController.php

    public function index()
    {
        /** @var object $usuarioLogado */
        $usuarioLogado = $this->request->user ?? null;

        $perPage = 10;
        $page = $this->request->getVar('page') ?? 1;

        $usuarios = $this->usuarioModel->orderBy('id', 'DESC')->paginate($perPage);
---
SELECT *
FROM `usuarios`
WHERE `usuarios`.`deleted_at` IS NULL
ORDER BY `id` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `usuarios`
WHERE `usuarios`.`deleted_at` IS NULL