app/Models/NiveisModel.php

SELECT *
FROM `niveis`
WHERE `id` = '1'
 LIMIT 1
---
    public function getNomeNivel($id)
    {
        return $this->where('id', $id)->first();