app/Models/NiveisModel.php

    public function listarComPaginacao(int $limite = 10, int $pagina = 1): array
    {
        return $this->orderBy('id', 'DESC')
            ->paginate($limite, 'default', $pagina);
---
SELECT *
FROM `niveis`
ORDER BY `id` DESC
 LIMIT 7
SELECT COUNT(*) AS `numrows`
FROM `niveis`