app/Models/PermissoesModel.php

    public function usuarioTemPermissao($nivelId, $slug)
    {
        return $this->select('np.allow')
            ->join('niveis_permissoes np', 'np.permissao_id = permissoes.id')
            ->where('np.nivel_id', $nivelId)
            ->where('permissoes.slug', $slug)
            ->where('np.allow', 1)
            ->first() !== null;
---
SELECT `np`.`allow`
FROM `permissoes`
JOIN `niveis_permissoes` `np` ON `np`.`permissao_id` = `permissoes`.`id`
WHERE `np`.`nivel_id` = '1'
AND `permissoes`.`slug` = 'papeis.editar'
AND `np`.`allow` = 1
 LIMIT 1

    public function BuscarPermissoesPeloNivel($nivelId)
{
    $permissoes = $this->select('
            permissoes.id,
            permissoes.slug,
            permissoes.descricao,
            permissoes.created_at,
            permissoes.updated_at,
            np.allow
        ')
        ->join('niveis_permissoes np', 'np.permissao_id = permissoes.id', 'inner')
        ->where('np.nivel_id', $nivelId)
        ->orderBy('permissoes.slug', 'ASC')
        ->findAll();
---
SELECT `permissoes`.`id`, `permissoes`.`slug`, `permissoes`.`descricao`, `permissoes`.`created_at`, `permissoes`.`updated_at`, `np`.`allow`
FROM `permissoes`
INNER JOIN `niveis_permissoes` `np` ON `np`.`permissao_id` = `permissoes`.`id`
WHERE `np`.`nivel_id` = '2'
ORDER BY `permissoes`.`slug` ASC