app/Models/TiposDeUsuarios.php

    public function BuscarNivelDeUsuario($id_usuario)
{
    return $this->where('id_nivel', $id_usuario)->first();
---
SELECT *
FROM `tiposdeusuarios`
WHERE `id_nivel` = '1'
 LIMIT 1